webpackHotUpdate("static\\development\\pages\\program.js",{

/***/ "./data/program.json":
/*!***************************!*\
  !*** ./data/program.json ***!
  \***************************/
/*! exports provided: 0, 1, 2, 3, 4, 5, 6, 7, 8, default */
/***/ (function(module) {

module.exports = JSON.parse("[{\"title\":\"테스트코드를 클린코드로 리팩토링하기 위해 테스트코드의 테스트코드도 클린코드로 짜다가 이력서를 다시 쓰게 된 경위서\",\"author\":\"Java\",\"description\":\"신입 Test Engineer인 Java가 클린코드 가이드라인을 통해 망가진 코드를 리팩토링하는 과정과 이를 통해 우리가 중소기업에 가면 안되는 이유에 대해 알아봅시다.\"},{\"title\":\"R로 만드는 웹 애플리케이션\",\"author\":\"조선니체\",\"description\":\"R과 shiny로 맞춤형 의학통계 웹을 제공한 경험을 공유합니다. 자주 쓰는 분석은 R패키지로 만들어 CRAN에 배포하였습니다.\"},{\"title\":\"웹에서 게임 개발자까지\",\"author\":\"소년코딩\",\"description\":\"웹 개발, 게임 개발 등 다양한 성장과정을 거친 한 초보 프로그래머의 5년간 기록을 통해 이렇게 살면 안된다를 배운다.\"},{\"title\":\"유지보수 어렵게 하는 방법 (JS)\",\"author\":\"CreeJee\",\"description\":\"흔하지않은 JS 안티패턴, 이 멋진 언어를 하는 모두에게 능지상승을!\"},{\"title\":\"개발 생산성과 시각화\",\"author\":\"착과\",\"description\":\"우리는 생산성을 높이기 위해 온갖 방법을 사용합니다. IDE를 사용하고, 플러그인을 설치하고, 모니터나 키보드를 바꾸기도 하죠. 그러나 여전히 복잡한 소스코드가 가진 의미를 한눈에 파악하긴 쉽지 않습니다. 이를 한 눈에 파악하든 말든 하는 방법이 있을까요?\"},{\"title\":\"GraphQL을 왜 써야할까?\",\"author\":\"에반유\",\"description\":\"GraphQL, 이렇게 주목받는 이유는 무엇일까요? GraphQL이 당신의 코드에 줄 수 있는 이점을 알아봅니다. 또한 일반적인 첫인상과 오해를 풀고, 그 무한한 활용성을 알아봅시다.\"},{\"title\":\"학부를 졸업하며 아쉬운 것들\",\"author\":\"슈개\",\"description\":\"아직 졸업을 안한 1~3학년 중 '학부를 졸업하면서 뭘 해야 후회를 안하고 이번에 졸업하는 사람은 무슨 생각을 가지고 있을지 궁금하다' 라는 생각을 누군가는 가지고 있을 것 같다. 사람마다 생각은 다 다르겠지만 내가 이번에 졸업하며 아쉬워하는 내용을 공유하고 생각을 나누려고 한다.\"},{\"title\":\"TGrid: 새 시대의 그리드 컴퓨팅\",\"author\":\"삼촌\",\"description\":\" - \"},{\"title\":\"간단하게 유사 트위치 만들어보기\",\"author\":\"OpenID검색\",\"description\":\" - \"}]");

/***/ })

})
//# sourceMappingURL=program.js.277a408a46c5ab6e42bf.hot-update.js.map